[NoCoverage] ArrayDeclaration
src/index.tsx:17:15
     </Top>
     <Scoreboard
       time="000"
-      levels={['beginner', 'intermediate', 'expert']}
+      levels={[]}
       mines="010"
       onReset={() => null}

[NoCoverage] StringLiteral
src/index.tsx:17:16
     </Top>
     <Scoreboard
       time="000"
-      levels={['beginner', 'intermediate', 'expert']}
+      levels={["", 'intermediate', 'expert']}
       mines="010"
       onReset={() => null}

[NoCoverage] ArrowFunction
src/index.tsx:19:16
       time="000"
       levels={['beginner', 'intermediate', 'expert']}
       mines="010"
-      onReset={() => null}
+      onReset={() => undefined}
     />
   </>,
