[Killed] ArrowFunction
src/components/Grid/Cell.tsx:25:34
   onContextMenu: (coords: Coords) => void;
 }
 
-export const checkCellIsActive = (cell: CellType) =>
-  [CellState.hidden, CellState.flag, CellState.weakFlag].includes(cell);
+export const checkCellIsActive = () => undefined;
 
 export const CellComponent: React.FC<CellProps> = ({
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).not.toBeCalled()

Expected number of calls: 0
Received number of calls: 1

1: [1, 1]

[Killed] ArrowFunction
src/components/Grid/Cell.tsx:35:19
 }) => {
   const [mouseDown, onMouseDown, onMouseUp] = useMouseDown();
 
-  const onClick = () => rest.onClick(coords);
+  const onClick = () => undefined;
 
   const onContextMenu = (elem: React.MouseEvent<HTMLElement>) => {
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/components/Grid/Cell.tsx:37:66
 
   const onClick = () => rest.onClick(coords);
 
-  const onContextMenu = (elem: React.MouseEvent<HTMLElement>) => {
-    /**
-     * Prevent context menu by default
-     */
-    elem.preventDefault();
-
-    if (checkCellIsActive(children)) {
-      rest.onContextMenu(coords);
-    }
-  };
+  const onContextMenu = (elem: React.MouseEvent<HTMLElement>) => {};
 
   const props = {
killedBy: Cell component check Check prevent default contextMenu for every type of cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:43:9
      */
     elem.preventDefault();
 
-    if (checkCellIsActive(children)) {
+    if (false) {
       rest.onContextMenu(coords);
     }
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/components/Grid/Cell.tsx:43:38
      */
     elem.preventDefault();
 
-    if (checkCellIsActive(children)) {
-      rest.onContextMenu(coords);
-    }
+    if (checkCellIsActive(children)) {}
   };
 
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
src/components/Grid/Cell.tsx:48:17
     }
   };
 
-  const props = {
-    onClick,
-    onContextMenu,
-    'data-testid': `${children}_${coords}`,
-    onMouseDown,
-    onMouseUp,
-    onMouseLeave: onMouseUp,
-    mouseDown,
-  };
+  const props = {};
 
   return <ComponentsMap {...props}>{children}</ComponentsMap>;
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 1
+ Received  + 0

  <DocumentFragment>

[Killed] StringLiteral
src/components/Grid/Cell.tsx:75:25
 const ComponentsMap: React.FC<ComponentsMapProps> = ({ children, ...rest }) => {
   const nonActiveCellProps = {
     onContextMenu: rest.onContextMenu,
-    'data-testid': rest['data-testid'],
+    'data-testid': rest[""],
   };
 
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 1
+ Received  + 0

  <DocumentFragment>

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:79:5
   };
 
   switch (children) {
-    case CellState.empty:
-      return <RevealedFrame {...nonActiveCellProps} />;
+    case CellState.empty:
     case CellState.bomb:
       return (
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 1
+ Received  + 5

  <DocumentFragment>

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:81:5
   switch (children) {
     case CellState.empty:
       return <RevealedFrame {...nonActiveCellProps} />;
-    case CellState.bomb:
-      return (
-        <BombFrame {...nonActiveCellProps}>
-          <Bomb />
-        </BombFrame>
-      );
+    case CellState.bomb:
     case CellState.flag:
       return (
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 10`

- Snapshot  - 2
+ Received  + 2

  <DocumentFragment>

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:87:5
           <Bomb />
         </BombFrame>
       );
-    case CellState.flag:
-      return (
-        <ClosedFrame {...rest}>
-          <Flag />
-        </ClosedFrame>
-      );
+    case CellState.flag:
     case CellState.weakFlag:
       return (
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 12`

- Snapshot  - 1
+ Received  + 1

@@ -2,9 +2,9 @@

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:93:5
           <Flag />
         </ClosedFrame>
       );
-    case CellState.weakFlag:
-      return (
-        <ClosedFrame {...rest}>
-          <WeakFlag />
-        </ClosedFrame>
-      );
+    case CellState.weakFlag:
     case CellState.hidden:
       return <ClosedFrame {...rest} />;
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 13`

- Snapshot  - 4
+ Received  + 0

  <DocumentFragment>

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:99:5
           <WeakFlag />
         </ClosedFrame>
       );
-    case CellState.hidden:
-      return <ClosedFrame {...rest} />;
+    case CellState.hidden:
     default:
       return <RevealedFrame {...nonActiveCellProps}>{children}</RevealedFrame>;
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 11`

- Snapshot  - 2
+ Received  + 4

  <DocumentFragment>

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:101:5
       );
     case CellState.hidden:
       return <ClosedFrame {...rest} />;
-    default:
-      return <RevealedFrame {...nonActiveCellProps}>{children}</RevealedFrame>;
+    default:
   }
 };
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 2`

- Snapshot  - 8
+ Received  + 1

- <DocumentFragment>

[Killed] BooleanLiteral
src/components/Grid/Cell.tsx:120:34
   height: 1.8vw;
   background-color: #d1d1d1;
   border: 0.6vh solid transparent;
-  border-color: ${({ mouseDown = false }) =>
+  border-color: ${({ mouseDown = true }) =>
     mouseDown ? 'transparent' : 'white #e9e9e9 #e9e9e9 white'};
   &:hover {
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] ArrowFunction
src/components/Grid/Cell.tsx:120:19
   height: 1.8vw;
   background-color: #d1d1d1;
   border: 0.6vh solid transparent;
-  border-color: ${({ mouseDown = false }) =>
-    mouseDown ? 'transparent' : 'white #e9e9e9 #e9e9e9 white'};
+  border-color: ${() => undefined};
   &:hover {
     filter: brightness(1.05);
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] StringLiteral
src/components/Grid/Cell.tsx:130:6
 const transparent = 'rgba(0,0,0,0)';
 const colors: { [key in CellType]: string } = {
   0: '#000',
-  1: '#2a48ec',
+  1: "",
   2: '#2bb13d',
   3: '#ec6561',
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 2`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] StringLiteral
src/components/Grid/Cell.tsx:132:6
   0: '#000',
   1: '#2a48ec',
   2: '#2bb13d',
-  3: '#ec6561',
+  3: "",
   4: '#233db7',
   5: '#a6070f',
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 4`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] StringLiteral
src/components/Grid/Cell.tsx:133:6
   1: '#2a48ec',
   2: '#2bb13d',
   3: '#ec6561',
-  4: '#233db7',
+  4: "",
   5: '#a6070f',
   6: '#e400af',
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 5`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] StringLiteral
src/components/Grid/Cell.tsx:134:6
   2: '#2bb13d',
   3: '#ec6561',
   4: '#233db7',
-  5: '#a6070f',
+  5: "",
   6: '#e400af',
   7: '#906a02',
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 6`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] StringLiteral
src/components/Grid/Cell.tsx:135:6
   3: '#ec6561',
   4: '#233db7',
   5: '#a6070f',
-  6: '#e400af',
+  6: "",
   7: '#906a02',
   8: '#fa0707',
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 7`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] StringLiteral
src/components/Grid/Cell.tsx:137:6
   5: '#a6070f',
   6: '#e400af',
   7: '#906a02',
-  8: '#fa0707',
+  8: "",
   9: transparent,
   10: transparent,
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 9`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] LogicalOperator
src/components/Grid/Cell.tsx:147:30
 const RevealedFrame = styled(ClosedFrame)`
   border-color: #dddddd;
   cursor: default;
-  color: ${({ children }) => colors[children as CellType] ?? transparent};
+  color: ${({ children }) => colors[(children as CellType)] && transparent};
   &:hover {
     filter: brightness(1);
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] ArrowFunction
src/components/Grid/Cell.tsx:147:12
 const RevealedFrame = styled(ClosedFrame)`
   border-color: #dddddd;
   cursor: default;
-  color: ${({ children }) => colors[children as CellType] ?? transparent};
+  color: ${() => undefined};
   &:hover {
     filter: brightness(1);
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>
