[Killed] ArrowFunction
src/components/Grid/Grid.tsx:22:36
   onContextMenu: (coords: Coords) => void;
 }
 
-export const Grid: FC<GridProps> = ({ children, ...rest }) => (
-  <Wrapper size={children.length}>
-    {children.map((row, y) =>
-      row.map((cell, x) => (
-        <CellComponent key={`${y}_${x}_${cell}`} coords={[y, x]} {...rest}>
-          {cell}
-        </CellComponent>
-      )),
-    )}
-  </Wrapper>
-);
+export const Grid: FC<GridProps> = () => undefined;
 
 interface WrapperProps {
killedBy: Grid renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Grid renders correctly 1`

- Snapshot  - 827
+ Received  +   1

- <DocumentFragment>

[Killed] ArrowFunction
src/components/Grid/Grid.tsx:24:19
 
 export const Grid: FC<GridProps> = ({ children, ...rest }) => (
   <Wrapper size={children.length}>
-    {children.map((row, y) =>
-      row.map((cell, x) => (
-        <CellComponent key={`${y}_${x}_${cell}`} coords={[y, x]} {...rest}>
-          {cell}
-        </CellComponent>
-      )),
+    {children.map(() => undefined,
     )}
   </Wrapper>
killedBy: Grid renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Grid renders correctly 1`

- Snapshot  - 821
+ Received  +   0

  <DocumentFragment>

[Killed] ArrowFunction
src/components/Grid/Grid.tsx:25:15
 export const Grid: FC<GridProps> = ({ children, ...rest }) => (
   <Wrapper size={children.length}>
     {children.map((row, y) =>
-      row.map((cell, x) => (
-        <CellComponent key={`${y}_${x}_${cell}`} coords={[y, x]} {...rest}>
-          {cell}
-        </CellComponent>
-      )),
+      row.map(() => undefined),
     )}
   </Wrapper>
killedBy: Grid renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Grid renders correctly 1`

- Snapshot  - 821
+ Received  +   0

  <DocumentFragment>

[Killed] StringLiteral
src/components/Grid/Grid.tsx:38:41
   size: number;
 }
 
-const Wrapper = styled.div<WrapperProps>`
-  display: grid;
-  grid-template-columns: repeat(${({ size }) => size}, auto);
-  width: max-content;
-  padding: 1vw;
-`;
+const Wrapper = styled.div<WrapperProps>``;
 
killedBy: Grid renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Grid renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] ArrowFunction
src/components/Grid/Grid.tsx:40:35
 
 const Wrapper = styled.div<WrapperProps>`
   display: grid;
-  grid-template-columns: repeat(${({ size }) => size}, auto);
+  grid-template-columns: repeat(${() => undefined}, auto);
   width: max-content;
   padding: 1vw;
killedBy: Grid renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Grid renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
