[Killed] ArrowFunction
src/components/Scoreboard/Level.tsx:11:43
   children: string[];
 }
 
-export const Level: FC<LevelProps> = memo(({ children }) => (
-  <Select>
-    {children.map((item: string) => (
-      <Option key={item} value={item}>
-        {item}
-      </Option>
-    ))}
-  </Select>
-));
+export const Level: FC<LevelProps> = memo(() => undefined);
 
 const Select = styled.select`
killedBy: Scoreboard renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Scoreboard renders correctly 1`

- Snapshot  - 22
+ Received  +  0

@@ -5,32 +5,10 @@

[Killed] ArrowFunction
src/components/Scoreboard/Level.tsx:13:19
 
 export const Level: FC<LevelProps> = memo(({ children }) => (
   <Select>
-    {children.map((item: string) => (
-      <Option key={item} value={item}>
-        {item}
-      </Option>
-    ))}
+    {children.map(() => undefined)}
   </Select>
 ));
killedBy: Scoreboard renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Scoreboard renders correctly 1`

- Snapshot  - 20
+ Received  +  1

@@ -7,30 +7,11 @@

[Killed] StringLiteral
src/components/Scoreboard/Level.tsx:21:29
   </Select>
 ));
 
-const Select = styled.select`
-  margin: 0;
-  border-radius: 0;
-  border: 0.15vw solid;
-  border-color: white #9e9e9e #9e9e9e white;
-  background-color: #d1d1d1;
-`;
+const Select = styled.select``;
 
 const Option = styled.option`
killedBy: Scoreboard renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Scoreboard renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -6,11 +6,11 @@
