[Killed] BlockStatement
src/components/Scoreboard/Reset.tsx:12:61
   onReset: () => void;
 }
 
-export const Reset: React.FC<ResetProps> = ({ onReset }) => {
-  const [mouseDown, onMouseDown, onMouseUp] = useMouseDown();
-
-  return (
-    <Button
-      onMouseDown={onMouseDown}
-      onMouseLeave={onMouseUp}
-      onMouseUp={onMouseUp}
-      onClick={onReset}
-    >
-      {mouseDown ? '😮' : '😊'}
-    </Button>
-  );
-};
+export const Reset: React.FC<ResetProps> = ({ onReset }) => {};
 
 const Button = styled.button`
killedBy: Scoreboard renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Scoreboard renders correctly 1`

- Snapshot  - 5
+ Received  + 0

@@ -27,15 +27,10 @@
