[Killed] ArrowFunction
src/components/Top/Legend.tsx:19:46
   secondAction: string;
 }
 
-export const Legend: React.FC<LegendProps> = ({
-  feature,
-  firstAction,
-  secondAction,
-}) => (
-  <Parent>
-    <strong>{feature}: </strong>
-    <FlagComboParent>
-      <code>
-        <FirstAction>{firstAction}</FirstAction> +{' '}
-        <SecondAction>{secondAction}</SecondAction>
-      </code>
-    </FlagComboParent>
-  </Parent>
-);
+export const Legend: React.FC<LegendProps> = () => undefined;
 
 const FlagComboParent = styled.code`
killedBy: Top renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Top renders correctly 1`

- Snapshot  - 24
+ Received  +  0

@@ -5,31 +5,7 @@

[Killed] StringLiteral
src/components/Top/Legend.tsx:39:36
   background: #e3e3e3;
 `;
 
-export const Parent = styled.legend`
-  font-size: 1em;
-  margin: 0 auto 2vw;
-  line-height: 1.25em;
-`;
+export const Parent = styled.legend``;
 
 const FirstAction = styled.span`
killedBy: Top renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Top renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -6,11 +6,11 @@
