[Killed] ArrowFunction
src/helpers/CellsManipulator.ts:3:35
 import { Cell, Coords, Field } from './Field';
 
-export const getNeighboursItems = ([y, x]: Coords): Record<string, Coords> => ({
-  top: [y - 1, x],
-  topRight: [y - 1, x + 1],
-  right: [y, x + 1],
-  rightBottom: [y + 1, x + 1],
-  bottom: [y + 1, x],
-  bottomLeft: [y + 1, x - 1],
-  left: [y, x - 1],
-  leftTop: [y - 1, x - 1],
-});
+export const getNeighboursItems = () => undefined;
 
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"bottom": [1, 0], "bottomLeft": [1, -1], "left": [0, -1], "leftTop": [-1, -1], "right": [0, 1], "rightBottom": [1, 1], "top": [-1, 0], "topRight": [-1, 1]}
Received: undefined

[Killed] ObjectLiteral
src/helpers/CellsManipulator.ts:3:80
 import { Cell, Coords, Field } from './Field';
 
-export const getNeighboursItems = ([y, x]: Coords): Record<string, Coords> => ({
-  top: [y - 1, x],
-  topRight: [y - 1, x + 1],
-  right: [y, x + 1],
-  rightBottom: [y + 1, x + 1],
-  bottom: [y + 1, x],
-  bottomLeft: [y + 1, x - 1],
-  left: [y, x - 1],
-  leftTop: [y - 1, x - 1],
-});
+export const getNeighboursItems = ([y, x]: Coords): Record<string, Coords> => ({});
 
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 34
+ Received  +  1

- Object {
-   "bottom": Array [
-     1,

[Killed] ArithmeticOperator
src/helpers/CellsManipulator.ts:4:9
 import { Cell, Coords, Field } from './Field';
 
 export const getNeighboursItems = ([y, x]: Coords): Record<string, Coords> => ({
-  top: [y - 1, x],
+  top: [y + 1, x],
   topRight: [y - 1, x + 1],
   right: [y, x + 1],
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -22,11 +22,11 @@
    "rightBottom": Array [
      1,

[Killed] ArithmeticOperator
src/helpers/CellsManipulator.ts:5:21
 
 export const getNeighboursItems = ([y, x]: Coords): Record<string, Coords> => ({
   top: [y - 1, x],
-  topRight: [y - 1, x + 1],
+  topRight: [y - 1, x - 1],
   right: [y, x + 1],
   rightBottom: [y + 1, x + 1],
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -27,8 +27,8 @@
      -1,
      0,

[Killed] ArithmeticOperator
src/helpers/CellsManipulator.ts:5:14
 
 export const getNeighboursItems = ([y, x]: Coords): Record<string, Coords> => ({
   top: [y - 1, x],
-  topRight: [y - 1, x + 1],
+  topRight: [y + 1, x + 1],
   right: [y, x + 1],
   rightBottom: [y + 1, x + 1],
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -26,9 +26,9 @@
    "top": Array [
      -1,

[Killed] ArithmeticOperator
src/helpers/CellsManipulator.ts:6:14
 export const getNeighboursItems = ([y, x]: Coords): Record<string, Coords> => ({
   top: [y - 1, x],
   topRight: [y - 1, x + 1],
-  right: [y, x + 1],
+  right: [y, x - 1],
   rightBottom: [y + 1, x + 1],
   bottom: [y + 1, x],
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -15,11 +15,11 @@
      -1,
      -1,

[Killed] ArithmeticOperator
src/helpers/CellsManipulator.ts:7:17
   top: [y - 1, x],
   topRight: [y - 1, x + 1],
   right: [y, x + 1],
-  rightBottom: [y + 1, x + 1],
+  rightBottom: [y - 1, x + 1],
   bottom: [y + 1, x],
   bottomLeft: [y + 1, x - 1],
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -18,11 +18,11 @@
    "right": Array [
      0,

[Killed] ArithmeticOperator
src/helpers/CellsManipulator.ts:7:24
   top: [y - 1, x],
   topRight: [y - 1, x + 1],
   right: [y, x + 1],
-  rightBottom: [y + 1, x + 1],
+  rightBottom: [y + 1, x - 1],
   bottom: [y + 1, x],
   bottomLeft: [y + 1, x - 1],
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -19,11 +19,11 @@
      0,
      1,

[Killed] ArithmeticOperator
src/helpers/CellsManipulator.ts:8:12
   topRight: [y - 1, x + 1],
   right: [y, x + 1],
   rightBottom: [y + 1, x + 1],
-  bottom: [y + 1, x],
+  bottom: [y - 1, x],
   bottomLeft: [y + 1, x - 1],
   left: [y, x - 1],
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Object {
    "bottom": Array [

[Killed] ArrayDeclaration
src/helpers/CellsManipulator.ts:8:11
   topRight: [y - 1, x + 1],
   right: [y, x + 1],
   rightBottom: [y + 1, x + 1],
-  bottom: [y + 1, x],
+  bottom: [],
   bottomLeft: [y + 1, x - 1],
   left: [y, x - 1],
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

@@ -1,10 +1,7 @@
  Object {
-   "bottom": Array [

[Killed] ArithmeticOperator
src/helpers/CellsManipulator.ts:9:16
   right: [y, x + 1],
   rightBottom: [y + 1, x + 1],
   bottom: [y + 1, x],
-  bottomLeft: [y + 1, x - 1],
+  bottomLeft: [y - 1, x - 1],
   left: [y, x - 1],
   leftTop: [y - 1, x - 1],
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,11 +2,11 @@
    "bottom": Array [
      1,

[Killed] ArithmeticOperator
src/helpers/CellsManipulator.ts:9:23
   right: [y, x + 1],
   rightBottom: [y + 1, x + 1],
   bottom: [y + 1, x],
-  bottomLeft: [y + 1, x - 1],
+  bottomLeft: [y + 1, x + 1],
   left: [y, x - 1],
   leftTop: [y - 1, x - 1],
killedBy: Field Generator Simple cases 2x2 field 50% density
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [2]

[Killed] ArithmeticOperator
src/helpers/CellsManipulator.ts:10:13
   rightBottom: [y + 1, x + 1],
   bottom: [y + 1, x],
   bottomLeft: [y + 1, x - 1],
-  left: [y, x - 1],
+  left: [y, x + 1],
   leftTop: [y - 1, x - 1],
 });
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -7,11 +7,11 @@
      1,
      -1,

[Killed] ArithmeticOperator
src/helpers/CellsManipulator.ts:11:13
   bottom: [y + 1, x],
   bottomLeft: [y + 1, x - 1],
   left: [y, x - 1],
-  leftTop: [y - 1, x - 1],
+  leftTop: [y + 1, x - 1],
 });
 
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -10,11 +10,11 @@
    "left": Array [
      0,

[Killed] ArithmeticOperator
src/helpers/CellsManipulator.ts:11:20
   bottom: [y + 1, x],
   bottomLeft: [y + 1, x - 1],
   left: [y, x - 1],
-  leftTop: [y - 1, x - 1],
+  leftTop: [y - 1, x + 1],
 });
 
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -11,11 +11,11 @@
      0,
      -1,

[Killed] ArrowFunction
src/helpers/CellsManipulator.ts:14:33
   leftTop: [y - 1, x - 1],
 });
 
-export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+export const checkItemInField = () => undefined;
 
 export const incrementNeighbours = (coords: Coords, field: Field) => {
killedBy: checkItemInField tests Simple cases Out of y range
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] LogicalOperator
src/helpers/CellsManipulator.ts:15:3
 });
 
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+  y >= 0 || x >= 0 && length - y > 0 && length - x > 0;
 
 export const incrementNeighbours = (coords: Coords, field: Field) => {
killedBy: checkItemInField tests Simple cases Out of x range
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/helpers/CellsManipulator.ts:15:3
 });
 
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+  y >= 0 && x >= 0 || length - y > 0 && length - x > 0;
 
 export const incrementNeighbours = (coords: Coords, field: Field) => {
killedBy: checkItemInField tests Simple cases Out of y range
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/helpers/CellsManipulator.ts:17:70
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
   y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
 
-export const incrementNeighbours = (coords: Coords, field: Field) => {
-  const items = getNeighboursItems(coords);
-
-  for (const item of Object.values(items)) {
-    if (checkItemInField(item, field)) {
-      const [y, x] = item;
-      const cell = field[y][x];
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
-    }
-  }
-
-  return field;
-};
+export const incrementNeighbours = (coords: Coords, field: Field) => {};
 
killedBy: Check increment neighbours simple cases field with only one item
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [[9]]
Received: undefined

[Killed] BlockStatement
src/helpers/CellsManipulator.ts:20:44
 export const incrementNeighbours = (coords: Coords, field: Field) => {
   const items = getNeighboursItems(coords);
 
-  for (const item of Object.values(items)) {
-    if (checkItemInField(item, field)) {
-      const [y, x] = item;
-      const cell = field[y][x];
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
-    }
-  }
+  for (const item of Object.values(items)) {}
 
   return field;
killedBy: Check increment neighbours simple cases filed 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] ConditionalExpression
src/helpers/CellsManipulator.ts:21:9
   const items = getNeighboursItems(coords);
 
   for (const item of Object.values(items)) {
-    if (checkItemInField(item, field)) {
+    if (false) {
       const [y, x] = item;
       const cell = field[y][x];
killedBy: Check increment neighbours simple cases filed 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] ConditionalExpression
src/helpers/CellsManipulator.ts:21:9
   const items = getNeighboursItems(coords);
 
   for (const item of Object.values(items)) {
-    if (checkItemInField(item, field)) {
+    if (true) {
       const [y, x] = item;
       const cell = field[y][x];
killedBy: Check increment neighbours simple cases field with only one item
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/helpers/CellsManipulator.ts:24:11
     if (checkItemInField(item, field)) {
       const [y, x] = item;
       const cell = field[y][x];
-      if (cell < 8) {
+      if (false) {
         field[y][x] = (cell + 1) as Cell;
       }
killedBy: Field Generator Simple cases 2x2 field 50% density
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] EqualityOperator
src/helpers/CellsManipulator.ts:24:11
     if (checkItemInField(item, field)) {
       const [y, x] = item;
       const cell = field[y][x];
-      if (cell < 8) {
+      if (cell <= 8) {
         field[y][x] = (cell + 1) as Cell;
       }
killedBy: Check increment neighbours 3x3 cases Field 3x3 synthetic case neighors cells is reached max possible bombs
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -3,15 +3,15 @@
      1,
      2,
