[Killed] ArrowFunction
src/helpers/Field.ts:15:36
   weakFlag: 12,
 };
 
-export const emptyFieldGenerator = (
-  size: number,
-  state: Cell = CellState.empty,
-): Field => new Array(size).fill(null).map(() => new Array(size).fill(state));
+export const emptyFieldGenerator = () => undefined;
 
 export const fieldGenerator = (size: number, density: number): Field => {
killedBy: Field Generator emptyFieldGenerator tests 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [[0, 0], [0, 0]]
Received: undefined

[Killed] ArrowFunction
src/helpers/Field.ts:18:44
 export const emptyFieldGenerator = (
   size: number,
   state: Cell = CellState.empty,
-): Field => new Array(size).fill(null).map(() => new Array(size).fill(state));
+): Field => new Array(size).fill(null).map(() => undefined);
 
 export const fieldGenerator = (size: number, density: number): Field => {
killedBy: Field Generator emptyFieldGenerator tests 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 2

  Array [
-   Array [
-     0,

[Killed] BlockStatement
src/helpers/Field.ts:20:73
   state: Cell = CellState.empty,
 ): Field => new Array(size).fill(null).map(() => new Array(size).fill(state));
 
-export const fieldGenerator = (size: number, density: number): Field => {
-  if (density < 0 || density > 1) {
-    throw new Error('Density must be between 0 and 1');
-  }
-
-  let unprocessedCells = size * size;
-  let restCellsWithBombs = unprocessedCells * density;
-
-  const result = emptyFieldGenerator(size);
-
-  for (let i = 0; i < size; i++) {
-    for (let j = 0; j < size; j++) {
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[i][j] = CellState.bomb;
-        incrementNeighbours([i, j], result);
-        restCellsWithBombs--;
-      }
-      unprocessedCells--;
-    }
-  }
-
-  return result;
-};
+export const fieldGenerator = (size: number, density: number): Field => {};
 
killedBy: Field Generator Simple cases wrong density
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Density must be between 0 and 1"

Received function did not throw

[Killed] ConditionalExpression
src/helpers/Field.ts:21:7
 ): Field => new Array(size).fill(null).map(() => new Array(size).fill(state));
 
 export const fieldGenerator = (size: number, density: number): Field => {
-  if (density < 0 || density > 1) {
+  if (false) {
     throw new Error('Density must be between 0 and 1');
   }
killedBy: Field Generator Simple cases wrong density
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Density must be between 0 and 1"

Received function did not throw

[Killed] ConditionalExpression
src/helpers/Field.ts:21:7
 ): Field => new Array(size).fill(null).map(() => new Array(size).fill(state));
 
 export const fieldGenerator = (size: number, density: number): Field => {
-  if (density < 0 || density > 1) {
+  if (false || density > 1) {
     throw new Error('Density must be between 0 and 1');
   }
killedBy: Field Generator Simple cases wrong density
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Density must be between 0 and 1"

Received function did not throw

[Killed] ArithmeticOperator
src/helpers/Field.ts:25:26
     throw new Error('Density must be between 0 and 1');
   }
 
-  let unprocessedCells = size * size;
+  let unprocessedCells = size / size;
   let restCellsWithBombs = unprocessedCells * density;
 
killedBy: Field Generator Simple cases 2x2 field with mines
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] ArithmeticOperator
src/helpers/Field.ts:26:28
   }
 
   let unprocessedCells = size * size;
-  let restCellsWithBombs = unprocessedCells * density;
+  let restCellsWithBombs = unprocessedCells / density;
 
   const result = emptyFieldGenerator(size);
killedBy: Field Generator Simple cases Smallest possible field without mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     0,

[Killed] EqualityOperator
src/helpers/Field.ts:30:19
 
   const result = emptyFieldGenerator(size);
 
-  for (let i = 0; i < size; i++) {
+  for (let i = 0; i >= size; i++) {
     for (let j = 0; j < size; j++) {
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] ConditionalExpression
src/helpers/Field.ts:30:19
 
   const result = emptyFieldGenerator(size);
 
-  for (let i = 0; i < size; i++) {
+  for (let i = 0; false; i++) {
     for (let j = 0; j < size; j++) {
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] ConditionalExpression
src/helpers/Field.ts:31:21
   const result = emptyFieldGenerator(size);
 
   for (let i = 0; i < size; i++) {
-    for (let j = 0; j < size; j++) {
+    for (let j = 0; false; j++) {
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
         result[i][j] = CellState.bomb;
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] EqualityOperator
src/helpers/Field.ts:31:21
   const result = emptyFieldGenerator(size);
 
   for (let i = 0; i < size; i++) {
-    for (let j = 0; j < size; j++) {
+    for (let j = 0; j >= size; j++) {
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
         result[i][j] = CellState.bomb;
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] ConditionalExpression
src/helpers/Field.ts:32:11
 
   for (let i = 0; i < size; i++) {
     for (let j = 0; j < size; j++) {
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
+      if (true) {
         result[i][j] = CellState.bomb;
         incrementNeighbours([i, j], result);
killedBy: Field Generator Simple cases Smallest possible field without mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     0,

[Killed] BlockStatement
src/helpers/Field.ts:32:66
 
   for (let i = 0; i < size; i++) {
     for (let j = 0; j < size; j++) {
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[i][j] = CellState.bomb;
-        incrementNeighbours([i, j], result);
-        restCellsWithBombs--;
-      }
+      if (restCellsWithBombs / unprocessedCells > Math.random()) {}
       unprocessedCells--;
     }
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] UpdateOperator
src/helpers/Field.ts:35:9
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
         result[i][j] = CellState.bomb;
         incrementNeighbours([i, j], result);
-        restCellsWithBombs--;
+        restCellsWithBombs++;
       }
       unprocessedCells--;
killedBy: Field Generator Simple cases 2x2 field 50% density
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 4
Received array:  [9, 9, 9, 9]

[Killed] UpdateOperator
src/helpers/Field.ts:37:7
         incrementNeighbours([i, j], result);
         restCellsWithBombs--;
       }
-      unprocessedCells--;
+      unprocessedCells++;
     }
   }
killedBy: Field Generator Simple cases 2x2 field with mines
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -2,9 +2,9 @@
    Array [
      9,
