[Killed] BlockStatement
src/hooks/useMouseDown.ts:11:53
   [boolean, SetMouseStatusDown, SetMouseStatusUp]
 >;
 
-export const useMouseDown = (): useMouseDownType => {
-  const [mouseDown, setMouseDown] = useState(false);
-
-  useDebugValue(`mouseDown: ${mouseDown}`);
-
-  const onMouseDown = () => setMouseDown(true);
-  const onMouseUp = () => setMouseDown(false);
-
-  return [mouseDown, onMouseDown, onMouseUp];
-};
+export const useMouseDown = (): useMouseDownType => {};
 
killedBy: Cell component check Cell renders correctly
statusReason: TypeError: Invalid attempt to destructure non-iterable instance.
In order to be iterable, non-array objects must have a [Symbol.iterator]() method.

[Killed] BooleanLiteral
src/hooks/useMouseDown.ts:12:46
 >;
 
 export const useMouseDown = (): useMouseDownType => {
-  const [mouseDown, setMouseDown] = useState(false);
+  const [mouseDown, setMouseDown] = useState(true);
 
   useDebugValue(`mouseDown: ${mouseDown}`);
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 11`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] ArrowFunction
src/hooks/useMouseDown.ts:16:23
 
   useDebugValue(`mouseDown: ${mouseDown}`);
 
-  const onMouseDown = () => setMouseDown(true);
+  const onMouseDown = () => undefined;
   const onMouseUp = () => setMouseDown(false);
 
killedBy: Reset button check should change state when onMouseDown and MouseUp events happens
statusReason: TestingLibraryElementError: Unable to find an element with the text: 😮. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="css-mt04f9"
    >

[Killed] BooleanLiteral
src/hooks/useMouseDown.ts:16:42
 
   useDebugValue(`mouseDown: ${mouseDown}`);
 
-  const onMouseDown = () => setMouseDown(true);
+  const onMouseDown = () => setMouseDown(false);
   const onMouseUp = () => setMouseDown(false);
 
killedBy: Reset button check should change state when onMouseDown and MouseUp events happens
statusReason: TestingLibraryElementError: Unable to find an element with the text: 😮. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="css-mt04f9"
    >

[Killed] BooleanLiteral
src/hooks/useMouseDown.ts:17:40
   useDebugValue(`mouseDown: ${mouseDown}`);
 
   const onMouseDown = () => setMouseDown(true);
-  const onMouseUp = () => setMouseDown(false);
+  const onMouseUp = () => setMouseDown(true);
 
   return [mouseDown, onMouseDown, onMouseUp];
killedBy: Reset button check should change state when onMouseDown and MouseUp events happens
statusReason: TestingLibraryElementError: Unable to find an element with the text: 😊. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="css-mt04f9"
    >

[Killed] ArrowFunction
src/hooks/useMouseDown.ts:17:21
   useDebugValue(`mouseDown: ${mouseDown}`);
 
   const onMouseDown = () => setMouseDown(true);
-  const onMouseUp = () => setMouseDown(false);
+  const onMouseUp = () => undefined;
 
   return [mouseDown, onMouseDown, onMouseUp];
killedBy: Reset button check should change state when onMouseDown and MouseUp events happens
statusReason: TestingLibraryElementError: Unable to find an element with the text: 😊. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="css-mt04f9"
    >

[Killed] ArrayDeclaration
src/hooks/useMouseDown.ts:19:10
   const onMouseDown = () => setMouseDown(true);
   const onMouseUp = () => setMouseDown(false);
 
-  return [mouseDown, onMouseDown, onMouseUp];
+  return [];
 };
 
killedBy: Reset button check should change state when onMouseDown and MouseUp events happens
statusReason: TestingLibraryElementError: Unable to find an element with the text: 😮. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="css-mt04f9"
    >
