[Killed] ArrowFunction
src/components/Scoreboard/Scoreboard.tsx:27:54
   mines: string;
 }
 
-export const Scoreboard: React.FC<ScoreboardProps> = ({
-  levels,
-  mines,
-  onReset,
-  time,
-}) => (
-  <Wrapper>
-    <Counter>{time}</Counter>
-    <Level>{levels}</Level>
-    <Reset onReset={onReset} />
-    <Counter>{mines}</Counter>
-  </Wrapper>
-);
+export const Scoreboard: React.FC<ScoreboardProps> = () => undefined;
 
 const Wrapper = styled.div`
killedBy: Scoreboard renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Scoreboard renders correctly 1`

- Snapshot  - 43
+ Received  +  1

- <DocumentFragment>
