[Killed] ArrowFunction
src/components/Scoreboard/Counter.tsx:11:59
   children: string;
 }
 
-export const Counter: React.FC<CounterProps> = React.memo(({ children }) => (
-  <Frame>{children}</Frame>
-));
+export const Counter: React.FC<CounterProps> = React.memo(() => undefined);
 
 const Frame = styled.div`
killedBy: Scoreboard renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Scoreboard renders correctly 1`

- Snapshot  - 10
+ Received  +  0

@@ -1,14 +1,9 @@

[Killed] StringLiteral
src/components/Scoreboard/Counter.tsx:15:25
   <Frame>{children}</Frame>
 ));
 
-const Frame = styled.div`
-  display: inline-block;
-  padding: 0 0.3vw;
-  color: #ec433c;
-  border: 0.15vw inset;
-  line-height: 2vw;
-  letter-spacing: 0.08em;
-  background: #333;
-  text-shadow: 0 0 0.1vw #ec433c;
-`;
+const Frame = styled.div``;
 
killedBy: Scoreboard renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Scoreboard renders correctly 1`

- Snapshot  - 2
+ Received  + 2

@@ -1,11 +1,11 @@
