[Killed] ArrowFunction
src/components/Top/Top.tsx:8:48
 
 export type TopComponentType = LegendProps & GameNameProps;
 
-export const Top: React.FC<TopComponentType> = ({
-  children,
-  ...legendProps
-}) => (
-  <Header>
-    <GameName>{children}</GameName>
-    <Legend {...legendProps} />
-  </Header>
-);
+export const Top: React.FC<TopComponentType> = () => undefined;
 
 const Header = styled.header`
killedBy: Top renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Top renders correctly 1`

- Snapshot  - 35
+ Received  +  1

- <DocumentFragment>
