[Killed] StringLiteral
src/components/Top/GameName.tsx:10:49
   children: string;
 }
 
-export const GameName = styled.h1<GameNameProps>`
-  font-size: 2em;
-`;
+export const GameName = styled.h1<GameNameProps>``;
 
killedBy: Top renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Top renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,11 +1,11 @@
